package indi.dmzz_yyhyy.lightnovelreader.data

data class BookContent(val url: String){
    var chaptersList: List<BookChapter> = listOf(
        BookChapter(
            "第一章", "    「你在干嘛？」\n" +
                    "\n" +
                    "    藤宫周和她──椎名真昼第一次说话，是在连绵细雨中看到她坐在公园秋千上的时候。\n" +
                    "\n" +
                    "    周今年升上高一后，便展开独居生活，而在他住的公寓房间右邻，住著一位天使。\n" +
                    "\n" +
                    "    所谓的天使当然只是一种比喻，但椎名真昼这名少女就是如此美丽可爱，使得这个比喻就像真的一样。\n" +
                    "\n" +
                    "    她那保养得宜的亚麻色长直发总是柔顺有光泽，透亮的乳白色肌肤保持著没有一丝粗糙的光滑感。鼻梁挺直端正，一双大眼边缘镶著纤长睫毛，还有著饱满水亮、形状优美的樱色嘴唇，以上要素皆体现出人造物般的精致之美。\n" +
                    "\n" +
                    "    周和她就读同一所高中，而且是同年级生，所以经常听到关于她的传闻，其中多半形容她是「文武双全的美少女」。\n" +
                    "\n" +
                    "    因为她在段考中始终维持第一名的成绩，在体育课上也有一流的活跃表现。由于两人不同班，周并不太清楚她的事情；但若是传闻没错，那她就真的是个完美超人了。\n" +
                    "\n" +
                    "    看起来没有什么明显的缺点，长得眉清目秀，成绩优异却不会因此骄矜自满，性格相当谦虚沉稳。这样的人会受欢迎也不奇怪。\n" +
                    "\n" +
                    "    和这样厉害的美少女比邻而居，想必有部分男生会相当羡慕，恨不得能置身同样情境吧。\n" +
                    "\n" +
                    "    话虽如此，周并不打算跟她发生什么，也不认为有那个机会。\n" +
                    "\n" +
                    "    在他眼中，椎名真昼这位少女当然很有魅力。\n" +
                    "\n" +
                    "    然而，两人不过是邻居的关系。周既没有机会和她说话，也没有打算和她扯上关系。\n" +
                    "\n" +
                    "    毕竟一扯上关系，自己恐怕会受到男生的嫉妒。再说，如果只是住在隔壁就能变得亲近的话，那些迷恋她的男生们就不用那么辛苦了。\n" +
                    "\n" +
                    "    顺带一提，感受到异性魅力未必等同于怀有恋爱感情。在周看来，真昼就是个最适合从远处观赏的美少女而已。\n" +
                    "\n" +
                    "    因此，周对于与她发展什么酸甜浪漫的关系不抱任何期待，也就不会主动去亲近对方。他只是住在真昼的隔壁，根本不曾与她接触。\n" +
                    "\n" +
                    "    所以，当周偶然看到她不撑伞独自待在雨中、显得很迷惘的时候，心里只想著「这个人在干嘛？」，并且露出了看著可疑人物的眼神。\n" +
                    "\n" +
                    "    雨大到所有人都匆匆赶回自己家里，她却在学校和公寓之间的一处公园里，一个人坐在秋千上。\n" +
                    "\n" +
                    "    （插图007）\n" +
                    "\n" +
                    "    （干嘛待在那边淋雨？）\n" +
                    "\n" +
                    "    天上覆盖著暗灰色的乌云，阳光照不下来，使得周遭景色一片昏暗。从早上下到现在的倾盆大雨，让视野变得更加模糊。尽管如此，那显眼的亚麻色头发和制服，却让周一眼就能认出她是真昼。\n" +
                    "\n" +
                    "    周不懂她为什么不撑伞，待在那里全身湿透地淋著雨。\n" +
                    "\n" +
                    "    她看起来不像是在等人，对于淋湿也没有感到抗拒，只是茫然地朝著某个方向看。\n" +
                    "\n" +
                    "    略微仰起的脸庞本就格外白皙，如今更显得气色不佳，甚至看上去很苍白。\n" +
                    "\n" +
                    "    即使身处那种运气不好马上就会感冒的状态，真昼仍然静静坐在那里。\n" +
                    "\n" +
                    "    既然她看起来不打算回家，应该是自愿在那边淋雨吧。或许轮不到别人来开口介入。\n" +
                    "\n" +
                    "    想到这里，周准备穿过公园──此时，他却看见真昼那垮下脸、几乎要哭出来的表情，于是忍不住搔了搔头。\n" +
                    "\n" +
                    "    他并没有想要和她扯上关系之类的动机。\n" +
                    "\n" +
                    "    可是，把露出那种表情的人放著不管，总觉得良心过不去。只是这样而已。\n" +
                    "\n" +
                    "    「……你在干嘛？」\n" +
                    "\n" +
                    "    为了表示自己没有别的意思，周用尽可能冷淡的语气向她搭话。接著，吸饱水分而变得沉重的一头长发晃了一下，转向周这里。\n" +
                    "\n" +
                    "    她的脸蛋还是一样漂亮。\n" +
                    "\n" +
                    "    即使被雨淋湿，也没有掩盖住她的光芒，反而连雨都成为衬托她美丽脸庞的小道具。那大概就是所谓的娇艳欲滴吧。\n" +
                    "\n" +
                    "    一对双眼皮大眼水灵灵地看著这边。\n" +
                    "\n" +
                    "    真昼姑且知道周是邻居，毕竟两人早上偶尔会擦身而过。\n" +
                    "\n" +
                    "    只是因为突然被搭话，再加上从不来往的人主动接触自己，她那双焦糖色的眼眸中反映出一丝警戒。\n" +
                    "\n" +
                    "    「藤宫同学，你找我有事？」\n" +
                    "\n" +
                    "    周心里莫名感慨地想著「原来她有记住我的姓氏啊」，同时察觉出她大概不会放松警惕。\n" +
                    "\n" +
                    "    虽说两人并非素未谋面，但是被他这样不熟的邻居搭话，也难怪她会增强防备。\n" +
                    "\n" +
                    "    她可能不太想和异性有什么牵扯。听说常常有各个年级的校内男生向她告白或试图接近，她恐怕觉得自己也别有用心吧。\n" +
                    "\n" +
                    "    「没什么。只是看你一个人在大雨中坐在这里，谁都会在意吧。」\n" +
                    "\n" +
                    "    「这样啊。谢谢你的关心，但我是自己想留在这里的，请不用在意。」\n" +
                    "\n" +
                    "    语气中没有尖锐露骨的警戒，她只是用温和却丝毫不容他人深究的淡然声音说道。\n" +
                    "\n" +
                    "    （唉，就知道会这样。）\n" +
                    "\n" +
                    "    她明显有什么隐情，但见她摆出「别管我」的拒绝态度，周便不打算追问下去了。\n" +
                    "\n" +
                    "    他原本就是一时兴起才搭话，询问原因也只是顺便，其实并没有多么在意。\n" +
                    "\n" +
                    "    如果她想要留在这里的话，那也没关系。\n" +
                    "\n" +
                    "    站在真昼的角度来看，周的行为反而会让她产生「为什么要跟我说话？」这种疑问吧。\n" +
                    "\n" +
                    "    真昼打量著周，那张柔弱的美丽脸蛋透露著猜疑的情绪，所以周只简短回道：「是喔。」\n" +
                    "\n" +
                    "    继续缠著她说话肯定会被讨厌，差不多该撤退了。\n" +
                    "\n" +
                    "    幸好，不管真昼对周的印象是好是坏，两人都毫不相千，因此他可以乾脆地做出决断，放著她不管自己回家。\n" +
                    "\n" +
                    "    不过，让少女独自一人在这里淋成落汤鸡，周感觉心里有点过意不去。\n" +
                    "\n" +
                    "    「那样会感冒的，你就撑伞回去吧。不用还没关系。」\n" +
                    "\n" +
                    "    所以，周在最后多管了一点闲事。\n" +
                    "\n" +
                    "    要是她因此感冒，总觉得自己睡觉吃饭都不能安心。抱著这种想法，周把原本撑在头上的伞递给她。\n" +
                    "\n" +
                    "    让她接过伞──正确地说是把伞硬塞给她之后，周就在她开口说话前转身离去了。\n" +
                    "\n" +
                    "    他快步离开时，背后传来真昼的声音。\n" +
                    "\n" +
                    "    那声音微弱到几乎被雨声掩盖，周就这么径自迅速地穿过了公园。\n" +
                    "\n" +
                    "    他想著「别感冒就好」而把伞硬塞给真昼后，似乎多少减轻了起初想无视她直接走掉时所产生的罪恶感。\n" +
                    "\n" +
                    "    既然她拒绝交谈，周也无意再和她有什么来往。\n" +
                    "\n" +
                    "    反正两人显然没缘分，不会有下次了。\n" +
                    "\n" +
                    "    至少在这个时候，再次踏上归途的周是这么想的。")
    )


}
